{"tool_name":"chemfp","contents":["biotools","bioschemas","biocontainers"],"fetched_metadata":{"biocontainers":{"name":"chemfp","identifiers":["biotools:chemfp","doi:10.26434/CHEMRXIV.7877846.V2","doi:10.1186/s13321-019-0398-8"],"license":"MIT","summary":"Chemfp is a set of command-lines tools for generating cheminformatics fingerprints and searching those fingerprints by tanimoto similarity, as well as a python library which can be used to build new tools. these algorithms are designed for the dense, 100-10,000 bit fingerprints which occur in small-molecule pharmaceutical nchemisty. the tanimoto search algorithms are implemented in c for performance and support both threshold and k-nearest searches.fingerprint generation can be done either by extracting existing fingerprint data from an sd file or by using an existing chemistry toolkit. chemfp supports the python libraries from open babel, nopeneye, and rdkit toolkits."},"biotools":{"id":"chemfp","home":"http://www.chemfp.com/","summary":"Fast cheminformatics fingerprint search, at your fingertips.\n\nChemfp is a set of command-line tools and a Python library for fingerprint generation and high-performance similarity search.\n\nThere are two ways to try out chemfp. From the download page page you can request an evaluation copy of the most recent version of chemfp, or you can download an earlier version for no cost under the MIT license","addition_date":"2020-01-09T17:31:56Z","last_update_date":"2020-12-11T19:30:38Z"},"bioschemas":{"name":"chemfp","home":"https://bio.tools/chemfp","summary":"Fast cheminformatics fingerprint search, at your fingertips.\n\nChemfp is a set of command-line tools and a Python library for fingerprint generation and high-performance similarity search.\n\nThere are two ways to try out chemfp. From the download page page you can request an evaluation copy of the most recent version of chemfp, or you can download an earlier version for no cost under the MIT license","tool_type":"sc:SoftwareApplication"}}}