{"tool_name":"mirtrace","contents":["biotools","biocontainers","bioschemas","bioconda"],"fetched_metadata":{"bioconda":{"name":"mirtrace","version":"1.0.1","home":"https://github.com/friedlanderlab/mirtrace","license":"GPL-2.0","summary":"miRTrace is a new quality control and taxonomic tracing tool developed specifically for small RNA sequencing data (sRNA-Seq). \nEach sample is characterized by profiling sequencing quality, read length, sequencing depth and miRNA complexity and also the \namounts of miRNAs versus undesirable sequences (derived from tRNAs, rRNAs and sequencing artifacts). In addition to these routine \nquality control (QC) analyses, miRTrace can accurately and sensitively resolve taxonomic origins of small RNA-Seq data based on the \ncomposition of clade-specific miRNAs. This feature can be used to detect cross-clade contaminations in typical lab settings. It can \nalso be applied for more specific applications in forensics, food quality control and clinical diagnosis, for instance tracing the \norigins of meat products or detecting parasitic microRNAs in host serum.\n","identifiers":["biotools:mirtrace","doi:10.1186/s13059-018-1588-9"]},"biocontainers":{"name":"mirtrace","identifiers":["biotools:mirtrace","doi:10.1186/s13059-018-1588-9"],"license":"GPL-2.0","summary":"Mirtrace is a new quality control and taxonomic tracing tool developed specifically for small rna sequencing data (srna-seq). each sample is characterized by profiling sequencing quality, read length, sequencing depth and mirna complexity and also the \\namounts of mirnas versus undesirable sequences (derived from trnas, rrnas and sequencing artifacts). in addition to these routine quality control (qc) analyses, mirtrace can accurately and sensitively resolve taxonomic origins of small rna-seq data based on the composition of clade-specific mirnas. this feature can be used to detect cross-clade contaminations in typical lab settings. it can also be applied for more specific applications in forensics, food quality control and clinical diagnosis, for instance tracing the origins of meat products or detecting parasitic micrornas in host serum."},"biotools":{"id":"miRTrace","home":"https://github.com/friedlanderlab/mirtrace","license":"GPL-3.0","summary":"Tool for quality control and tracing taxonomic origins of microRNA sequencing data.","addition_date":"2019-08-11T17:32:06Z","last_update_date":"2020-06-16T10:55:25Z","tool_type":["Command-line tool"]},"bioschemas":{"name":"miRTrace","home":"https://bio.tools/miRTrace","license":"GPL-3.0","summary":"Tool for quality control and tracing taxonomic origins of microRNA sequencing data.","tool_type":"sc:SoftwareApplication"}}}