{"tool_name":"rnastructure","contents":["biotools","biocontainers","bioschemas","bioconda"],"fetched_metadata":{"bioconda":{"name":"rnastructure","version":6.4,"home":"http://rna.urmc.rochester.edu/RNAstructure.html","license":"GPL-2.0-only","summary":"RNAstructure is a complete package for RNA and DNA secondary structure  prediction and analysis. It includes algorithms for   secondary structure  prediction, including facility to predict base pairing probabilities. It  also can be used to predict bimolecular structures and can predict the  equilibrium binding affinity of an oligonucleotide to a structured RNA  target. This is useful for siRNA design. It can also predict secondary  structures common to two, unaligned sequences, which is much more accurate  than single sequence secondary structure prediction. Finally, RNAstructure  can take a number of different types of experiment mapping data to constrain  or restrain structure prediction. These include chemical mapping, enzymatic  mapping, NMR, and SHAPE data.","identifiers":["biotools:rnastructure"]},"biocontainers":{"name":"rnastructure","identifiers":["biotools:rnastructure","doi:10.1093/bioinformatics/btv682"],"license":"GPL-2.0","summary":"Rnastructure is a complete package for rna and dna secondary structure  prediction and analysis. it includes algorithms for   secondary structure  prediction, including facility to predict base pairing probabilities. it  also can be used to predict bimolecular structures and can predict the  equilibrium binding affinity of an oligonucleotide to a structured rna  target. this is useful for sirna design. it can also predict secondary  structures common to two, unaligned sequences, which is much more accurate  than single sequence secondary structure prediction. finally, rnastructure  can take a number of different types of experiment mapping data to constrain  or restrain structure prediction. these include chemical mapping, enzymatic  mapping, nmr, and shape data."},"biotools":{"id":"rnastructure","home":"http://rna.urmc.rochester.edu/RNAstructure.html","summary":"A complete package for RNA and DNA secondary structure prediction and analysis. It includes algorithms for secondary structure prediction, including facility to predict base pairing probabilities. It also can be used to predict bimolecular structures and can predict the equilibrium binding affinity of an oligonucleotide to a structured RNA target.","addition_date":"2017-03-25T16:29:56Z","last_update_date":"2024-11-25T15:38:17.233698Z","tool_type":["Desktop application","Web application"]},"bioschemas":{"name":"RNAstructure","home":"https://bio.tools/rnastructure","summary":"A complete package for RNA and DNA secondary structure prediction and analysis. It includes algorithms for secondary structure prediction, including facility to predict base pairing probabilities. It also can be used to predict bimolecular structures and can predict the equilibrium binding affinity of an oligonucleotide to a structured RNA target.","tool_type":"sc:SoftwareApplication"}}}